IDEA Connection Link
ConnectionLink.GetConnectionData Method
[Missing <summary> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.GetConnectionData(System.Guid)"]
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public string GetConnectionData(
	Guid connectionId
)
Public Function GetConnectionData (
	connectionId As Guid
) As String
public:
virtual String^ GetConnectionData(
	Guid connectionId
) sealed
Parameters
connectionId
Type: System.Guid
[Missing <param name="connectionId"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.GetConnectionData(System.Guid)"]
Return Value
Type: String
[Missing <returns> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.GetConnectionData(System.Guid)"]
Implements
IAppController.GetConnectionData(Guid)
See Also
Reference
ConnectionLink Class
IdeaRS.ConnectionLink Namespace